import os

CITIES = ['基隆市', '臺北市', '新北市', '桃園市', '新竹市', '新竹縣',
          '苗栗縣', '臺中市', '彰化縣', '南投縣', '雲林縣', '嘉義市',
          '嘉義縣', '臺南市', '高雄市', '屏東縣',
          '宜蘭縣', '花蓮縣', '臺東縣',
          '澎湖縣', '金門縣', '連江縣']

CITY_CODE = {"宜蘭縣": "F-D0047-001", "桃園市": "F-D0047-005", "新竹縣": "F-D0047-009", "苗栗縣": "F-D0047-013",
             "彰化縣": "F-D0047-017", "南投縣": "F-D0047-021", "雲林縣": "F-D0047-025", "嘉義縣": "F-D0047-029",
             "屏東縣": "F-D0047-033", "臺東縣": "F-D0047-037", "花蓮縣": "F-D0047-041", "澎湖縣": "F-D0047-045",
             "基隆市": "F-D0047-049", "新竹市": "F-D0047-053", "嘉義市": "F-D0047-057", "臺北市": "F-D0047-061",
             "高雄市": "F-D0047-065", "新北市": "F-D0047-069", "臺中市": "F-D0047-073", "臺南市": "F-D0047-077",
             "連江縣": "F-D0047-081", "金門縣": "F-D0047-085"}

STAR_SIGNS = ['牡羊座', '金牛座', '雙子座', '巨蟹座', '獅子座', '處女座', '天秤座', '天蠍座', '射手座', '魔羯座',
              '水瓶座', '雙魚座']

STAR_SIGN_CODE = {'牡羊座': '白羊座', '金牛座': '金牛座', '雙子座': '双子座',
                  '巨蟹座': '巨蟹座', '獅子座': '狮子座', '處女座': '处女座',
                  '天秤座': '天秤座', '天蠍座': '天蝎座', '射手座': '射手座',
                  '魔羯座': '摩羯座', '水瓶座': '水瓶座', '雙魚座': '双鱼座'}

WEATHER_SERVICE_TOKEN = os.getenv('WEATHER_SERVICE_TOKEN')
CHANNEL_ACCESS_TOKEN = os.getenv('CHANNEL_ACCESS_TOKEN')
CHANNEL_SECRET = os.getenv('CHANNEL_SECRET')
